//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="%d/%d lépés végrehajtása: entitástároló létrehozása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="%d/%d lépés végrehajtása: bootstrap adatbázis létrehozása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="%d/%d lépés végrehajtása: kérelem-várólista adatbázásának létrehozása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="%d/%d lépés végrehajtása: a teljes entitástároló letöltése. Eddig megérkezett: %s/%s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="%d/%d lépés végrehajtása: lejárt kérelmek törlése";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="%d/%d lépés végrehajtása: metaadatok betöltése";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="%d/%d lépés végrehajtása: kérelem-várólista összevonásának végrehajtása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="%d/%d lépés végrehajtása: tranzakció-összevonás végrehajtása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="%d/%d lépés végrehajtása: létrehozás, törlés, összevonás végrehajtása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="%d/%d lépés végrehajtása: %s lekérdezés meghatározásának feldolgozása %s segítségével";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="%d/%d lépés végrehajtása: kérelmek feldolgozása. %s/%s módosítási kérelem elküldése.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="%d/%d lépés végrehajtása: módosítások újbóli alkalmazása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="%d/%d lépés végrehajtása: megérkezett adatok elemzése";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="%d/%d lépés végrehajtása: adatok fogadása a szerverről. Eddig megérkezett: %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="%d/%d lépés végrehajtása: törölt kapcsolatok eltávolítása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="%d/%d lépés végrehajtása: eltávolítás feltöltés után tulajdonsággal megadott kéremek eltávolítása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="%d/%d lépés végrehajtása: adatok küldése a szerverre. Eddig elküldve: %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="%d/%d lépés végrehajtása: entitástároló-adatbázis elküldése. Eddig elküldve: %s/%s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="%d/%d lépés végrehajtása: kérelem-várólista adatbázisának elküldése. Eddig elküldve: %s/%s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="%d/%d lépés végrehajtása: a szerverrel való kommunikáció elindítása";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="%d/%d lépés végrehajtása: kérelmek előfeldolgzoása feltöltés előtt";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="%d/%d lépés végrehajtása: várakozás a letöltésre";

